export const namePattern = /([А-ЯЁ][а-яё]+\\s[А-ЯЁ][а-яё]+\\s[А-ЯЁ][а-яё]+)/;
export const phonePattern = /(\\+7|8)[\\s\\-()]?(\\d{3})[\\s\\-()]?(\\d{3})[\\s\\-()]?(\\d{2})[\\s\\-()]?(\\d{2})/;
export const zipPattern = /\\b\\d{6}\\b/;
export const regionPattern = /(Московская область|Санкт[-\\s]?Петербург|Московская|Омская|Ивановская|Калининградская|Тульская|Тверская|Татарстан|Башкортостан|Алтайский край|.*?край|.*?область)/i;
export const emailPattern = /[\\w.-]+@[\\w.-]+\\.[A-Za-z]{2,}/;
export const birthdatePattern = /\\b\\d{2}[./-]\\d{2}[./-]\\d{2,4}\\b/;
export const streetKvPattern = /(кв\\.?\\s?\\d+|корп\\.?\\s?\\d+|под\\.?\\s?\\d+|дом\\s?\\d+|д\\.?\\s?\\d+)/i;
export const cityPattern = /г\\.?\\s?[А-ЯЁа-яё\\-\\s]+|Санкт[-\\s]?Петербург|Москва|Пятигорск|Омск|Иваново|Калининград|Тольятти/i;
